In [1]:
# Import dependencies# Impor 
import sqlite3
import pandas as pd

In [2]:
# Connect to database
conn = sqlite3.connect('database.sqlite')

In [3]:
# Read sqlite query results into a pandas DataFrame
bi_df = pd.read_sql_query("""

SELECT 

student_name,
gender,
grade,
school_name,
type,
reading_score,
math_score

FROM students_table 

INNER JOIN schools_table 

USING (School_name)

;

""",conn)

bi_df.head()

,student_name,gender,grade,school_name,type,reading_score,math_score
0,Kevin Logan,M,9th,Stewart High School,Charter,93,98
1,Earl Bush,M,10th,Stewart High School,Charter,99,92
2,Jeffrey Williamson,M,10th,Stewart High School,Charter,98,98
3,Karen Dean,F,10th,Stewart High School,Charter,97,77
4,Rebecca Reyes,F,11th,Stewart High School,Charter,89,87

In [4]:
# Save clean data to csv# Save  
bi_df.to_csv('clean_data/bi_data.csv', index = False)